nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/apps/linux/example/cc13xx-sbl/app/linux/main.c
/******************************************************************************

 @file main.c

 @brief CC13xx Bootloader Example Application

 Group: WCS LPC
 Target Device: cc13xx_cc26xx

 ******************************************************************************
 
 Copyright (c) 2016-2021, Texas Instruments Incorporated
 All rights reserved.

 Redistribution and use in source and binary forms, with or without
 modification, are permitted provided that the following conditions
 are met:

 *  Redistributions of source code must retain the above copyright
    notice, this list of conditions and the following disclaimer.

 *  Redistributions in binary form must reproduce the above copyright
    notice, this list of conditions and the following disclaimer in the
    documentation and/or other materials provided with the distribution.

 *  Neither the name of Texas Instruments Incorporated nor the names of
    its contributors may be used to endorse or promote products derived
    from this software without specific prior written permission.

 THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

 ******************************************************************************
 
 
 *****************************************************************************/

#define _GNU_SOURCE /* for strcasestr */
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <fcntl.h>
#include <unistd.h>
#include <sys/stat.h>
#include <stdarg.h>
#include <signal.h>

#include "sblUart.h"
#include "cc13xxdnld.h"

#define CONSOLE_COLOR_GREEN     "\033[32m"          /* Green */
#define CONSOLE_COLOR_RED       "\033[31m"          /* Red */
#define CONSOLE_COLOR_YELLOW    "\033[33m"          /* Yellow */
#define CONSOLE_COLOR_RESET     "\033[m"            /* Reset Color */

#define DATA_BUFFER_SIZE            32768 /*32K*/

/* \brief Flash start address for erase, download and verify */
static unsigned int startAddress = 0;
/* \brief Erase flag. If true the CC13xx/26xx Flash will be erased */
static bool eraseFlg = false;
/* \brief Program flag. If true the CC13xx/26xx Flash will be Programed */
static bool programFlg = false;
/* \brief Verify flag. If true the CC13xx/26xx Flash will be Verified */
static bool verifyFlg = false;
/* \brief Binary Mode flag. Set by reading the file extension to decide
          if the download image is binary or Intel Hex format */
static bool binMode = false;
static int hex_lineno;
/* Save port state */
static bool portIsOpen = false;

/* \brief CcDnld_UartFxns_t UART callback functions */
static uint8_t uartReadByte(void);
static void uartWriteByte(uint8_t byte);
static void uartWrite(uint8_t *data, unsigned int len);
static void printColor( const char *color,  const char *fmt, ... );
static void downloadFile(FILE* sblFileHandle, unsigned int byteCount, char *deviceType);
static void verifyFile(FILE* sblFileHandle, unsigned int byteCount);

static CcDnld_UartFxns_t sblUartFxns = {
    uartReadByte,
    uartWriteByte,
    uartWrite
};



static uint8_t uartReadByte(void)
{
    uint8_t readByte;
    SblUart_read(&readByte, 1);
    return readByte;
}

static void uartWriteByte(uint8_t byte)
{
    SblUart_write(&byte, 1);
}

static void uartWrite(uint8_t *data, unsigned int len)
{
    SblUart_write(data, len);
}

static void usage(char* exeName)
{
    printf("Usage: %s [SERIEL DEVICE] [FILE] [DEVICE TYPE] [OPTION]... \n", exeName);
    printf("-e                                          Erase with optional [START ADDRESS]\n");
    printf("-p                                          Program [FILE] with optional [START ADDRESS]\n");
    printf("-v                                          Verify [FILE] with optional [START ADDRESS]\n");
    printf("--start=[START ADDRESS] Start address for Flash erase, program load and verify\n");
    printf("\nExample: \n%s /dev/ttyS1 FILENAME.BIN [cc13x0, cc13x2, cc26x0 or cc26x2] -e -p -v\n", exeName);
}

static bool convertNumber( const char *txt, unsigned int *num)
{
    char *end_ptr;

   /* accept hex, decimal or octal number format */
   *num = strtol(  txt, &end_ptr, 0 );
    if( (end_ptr==txt) || (*end_ptr != 0) ){
         fprintf(stderr, "Not a number: %s\n", txt );
         return false; /* error */
    }
    else
    {
         return true;
    }
}

static void printColor( const char *color,  const char *fmt, ... )
{
    va_list args;
    printf( "%s", color );
    va_start(args,fmt);
    vprintf( fmt, args );
    va_end(args);
    printf( CONSOLE_COLOR_RESET );
}

static void getOptions(int argc, char* argv[])
{
    unsigned int argIdx;
    char *numStart;

    for(argIdx = 1; argIdx < argc; argIdx++)
    {
        if(strcmp(argv[argIdx], "-e") == 0)
        {
            eraseFlg = true;
        }
        else if(strcmp(argv[argIdx], "-p") == 0)
        {
            programFlg = true;
        }
        else if(strcmp(argv[argIdx], "-v") == 0)
        {
            verifyFlg = true;
        }
        else if((numStart = strstr(argv[argIdx], "--start=")) > 0)
        {
            numStart += 8; /* index to end of "--start=" */
            if(!convertNumber(numStart, &startAddress))
            {
                printColor(CONSOLE_COLOR_RED, "Start Address %s not a number. Ignoring --start option\n", numStart);
                startAddress = 0;
            }
            else
            {
                /* The startAddress must still be verified with the verifyStartAddress() function
                        after the deviceId has been detected and we know the proper pageSize
                */
                printf("Start Address: 0x%x\n", startAddress);
            }
        }

