nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/apps/linux/example/cc13xx-sbl/app/linux/main.c
    }
}


static void handle_eol_sequence( FILE *fp )
{
    int a,b;

    a = fgetc(fp);
    b = fgetc(fp);
    if( (a=='\r') && (b=='\n') )
    {
        /* MS-DOS format, all is good */
        return;
    }
    if( a == '\r' ){
        /* MAC format, unget B if not eof */
        if( b != EOF ){
            ungetc( b, fp );
        }
        return;
    }
    if( a == '\n' ){
        /* UNIX format unget B if not eof */
        if( b != EOF ){
            ungetc(b,fp);
        }
        return;
    }
    /* something is wrong */
    printColor(CONSOLE_COLOR_RED, "Line: %d bad EOL sequence\n", hex_lineno );
    exit(EXIT_FAILURE);
}

static int getNextIntelHexRecords(unsigned char *pData, unsigned int *startAddr, unsigned int *byteCount, FILE* sblFileHandle)
{
    unsigned char sectorStartAddrHigh, sectorStartAddrLow, sectorSize, recordType;
    unsigned int dataIdx = 0, dataOffset = 0;
    static unsigned short extLinearAddr = 0;
    unsigned char bytesRead;
    int done = 0;
    unsigned int prevSectorEndAddr = -1; /*set it to something that will never happen */
    unsigned int sectorStartAddr;


    *byteCount = 0;

    /* check if it is the start of file and set extLinearAddr to 0 */
    if(ftell(sblFileHandle) == 0)
    {
        extLinearAddr = 0;
    }

    while( (feof(sblFileHandle) == 0) && !done)
    {
        int match;
        int read;
        char pHexStrBuf[1092] = {0};
        unsigned char checksum=0, targetCheckSum;

        hex_lineno++;

        /* read record header */
        read = fread(pHexStrBuf, 1, 9, sblFileHandle);

        if(read != 9)
        {
            printColor(CONSOLE_COLOR_RED, "Error reading file: could not read sector header\n");
            exit(EXIT_FAILURE);
        }

        match = sscanf(pHexStrBuf, ":%02hhx%02hhx%02hhx%02hhx", &sectorSize, &sectorStartAddrHigh, &sectorStartAddrLow, &recordType);
        if(match != 4)
        {
            printColor(CONSOLE_COLOR_RED, "Error reading file: sector header match = %d\n", match);
            printf("line: %d, %s\n", hex_lineno, pHexStrBuf);
            exit(EXIT_FAILURE);
        }

        sectorStartAddr = (sectorStartAddrHigh << 8) | sectorStartAddrLow;

        /*update checksum */
        checksum = sectorSize;
        checksum += sectorStartAddrHigh;
        checksum += sectorStartAddrLow;
        checksum += recordType;

        /*if this is the first sector set the start address */
        if(prevSectorEndAddr == -1)
        {
            /* set the start address and add the extended Linear start address */
            *startAddr = sectorStartAddr | ((extLinearAddr << 16) & 0xFFFF0000);
        }

        /* check if this is he first sector read, or if the next sector is concurrent then read another sector */
        if( ((prevSectorEndAddr == -1) || (prevSectorEndAddr == sectorStartAddr)) &&
             ((dataOffset + sectorSize) < DATA_BUFFER_SIZE) )
        {
            /* check it is a data record */
            if(recordType == 0)
            {
                /*if this is the first sector set the start address */
                if(prevSectorEndAddr == -1)
                {
                    /* set the start address and add the extended Linear start address */
                    *startAddr = sectorStartAddr | (extLinearAddr << 16);
                }

                /* read data, CRC byte and *NOT* the cr/lf */
                bytesRead = fread(pHexStrBuf, 1, (sectorSize+1)*2, sblFileHandle);
                /* now the crlf */
                handle_eol_sequence(sblFileHandle);
                if(bytesRead != ((sectorSize+1)*2))
                {
                    printColor(CONSOLE_COLOR_RED, "Error reading file: bytes read %d\n", bytesRead);
                    printf("%s\n", pHexStrBuf);
                    exit(EXIT_FAILURE);
                }

                for(dataIdx = 0; dataIdx < sectorSize; dataIdx++)
                {
                    /*convert hex string to unsigned char */
                    match = sscanf(&pHexStrBuf[dataIdx*2], "%2hhx", &pData[dataOffset + dataIdx]);
                    if(match != 1)
                    {
                        printColor(CONSOLE_COLOR_RED, "Error reading ihex record: data match = %d dataIdx = %d\n", match, dataIdx);
                        printf("%s\n", pHexStrBuf);
                        exit(EXIT_FAILURE);
                    }
                    *byteCount += 1;
                    checksum += pData[dataOffset + dataIdx];
                }

                dataOffset += dataIdx;

                /* take 2's complement and check checksum */
                sscanf(&pHexStrBuf[dataIdx*2], "%2hhx", &targetCheckSum);
                checksum = -(unsigned int)checksum;
                if(checksum != targetCheckSum)
                {
                    printColor(CONSOLE_COLOR_RED, "Error reading ihex record: checksum mismatch %2hhx:%2hhx\n", checksum, targetCheckSum);
                    printf("%s\n", pHexStrBuf);
                    exit(EXIT_FAILURE);
                }
            }
            else if(recordType == 4)
            {
                unsigned char extLinearAddrHigh, extLinearAddrLow, crc;

                /*set extended linear address */
                bytesRead = fread(pHexStrBuf, 1, (sectorSize+1)*2, sblFileHandle);
                /* now the crlf */
                handle_eol_sequence(sblFileHandle);

                if(bytesRead != (sectorSize+1)*2)
                {
                    printColor(CONSOLE_COLOR_RED, "Error reading file: bytes read %d\n", bytesRead);
                    printf("%s\n", pHexStrBuf);
                    exit(EXIT_FAILURE);
                }

                match = sscanf(pHexStrBuf, "%2hhx%2hhx%2hhx", &extLinearAddrHigh, &extLinearAddrLow, &crc);
                if(match != 3)
                {
                    printColor(CONSOLE_COLOR_RED, "Error reading file: extLinearAddr match = %d\n", match);
                    printf("%s\n", pHexStrBuf);
                    exit(EXIT_FAILURE);
                }
                extLinearAddr = (extLinearAddrHigh << 8) | extLinearAddrLow;

                /* developers can add feature to check CRC */

