nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/apps/linux/example/cc13xx-sbl/app/linux/main.c
                *byteCount = 0;
                done = 1;
            }
            else if(recordType == 1)
            {
                /* its the eof record read the remaining bytes */
                while(feof(sblFileHandle) == 0)
                {
                    fread(pHexStrBuf, 1, 1, sblFileHandle);
                }
            }
            else
            {
                /* record type currently not supported */
                printColor(CONSOLE_COLOR_RED, "Error unsupported intel hex record type %x\n", recordType);
                exit(EXIT_FAILURE);
            }

            //set the previous sector end address to check if the next is concurrent
            prevSectorEndAddr = sectorStartAddr + sectorSize;

        }
        else
        {
            /*next sector is not concurrent rewind the file descriptor to start of sector */
            fseek(sblFileHandle, -9, SEEK_CUR);
            done = 1;
        }
    }

    return 0;
}

static void printProgressBar(float percentDone)
{
    uint8_t doneIdx;

    printf("\r[");
    for(doneIdx = 0; doneIdx < 50; doneIdx++)
    {
        if(doneIdx <= (uint8_t)(percentDone/2))
        {
            printf("=");
        }
        else
        {
            printf(" ");
        }
    }
    printf("] %d%% \r", (uint8_t)percentDone);
    fflush(stdout);

    if(percentDone == 100)
    {
         printColor(CONSOLE_COLOR_GREEN, "\r[==================================================] 100%%\n");
    }
}

static void connectToBootloader(void)
{
    printf("Connecting:\n");
    while(CcDnld_connect() != CcDnld_Status_Success)
    {
        char indicator[4] = "|/-\\";
        static uint8_t indicatorIdx = 0;
        printf("\r%c\r", indicator[++indicatorIdx & 0x3]);
        fflush(stdout);
    }
    printColor(CONSOLE_COLOR_GREEN, "\rConnected\n");
}

static void verifyStartAddress(uint32_t pageSize)
{
    /* Verify that the startAddress is at the top of a page in Flash. If it is not at the top of
        a page then it will be ignored and the user will be notified that it has been so
    */
    if((startAddress % pageSize)  != 0)
    {
        printColor(CONSOLE_COLOR_RED, "Start Address 0x%x not on page boundary. Ignoring --start option\n", startAddress);
        startAddress = 0;
    }
}

static void eraseFlash(char * deviceType)
{
    CcDnld_Status ccDnldStatus;
    uint8_t pageIdx;

    uint32_t pageSize = CcDnld_getPageSize(deviceType);
    uint32_t numPages = CcDnld_getNumPages(deviceType);

    printf("Erasing: \n[                                                  ] 00%%");
    fflush(stdout);

    /* set erase page start */
    pageIdx = startAddress / pageSize;

    for(; pageIdx < numPages; pageIdx++)
    {
        float percentDone = 100 * ((float)pageIdx / (float)numPages);
        printProgressBar(percentDone);

        ccDnldStatus = CcDnld_flashEraseRange(pageIdx * pageSize, pageSize, deviceType);
        if(ccDnldStatus != CcDnld_Status_Success)
        {
            printColor(CONSOLE_COLOR_RED, "\n\rFlash erase failed error status %x\n", ccDnldStatus);
            exit(EXIT_FAILURE);
        }
    }
    printProgressBar(100);
}

static void downloadFile(FILE* sblFileHandle, unsigned int byteCount, char *deviceType)
{
    CcDnld_Status ccDnldStatus;
    uint8_t pData[DATA_BUFFER_SIZE];
    unsigned int dataIdx = 0;
    unsigned int bytesInTransfer;
    unsigned int byesInBuffer = 0;
    unsigned int bytesLeft;

    printf("Downloading: \n[                                                  ] 00%%");

    if(binMode)
    {
        CcDnld_startDownload(startAddress, byteCount, deviceType);

    }
    else
    {
        /* Intel hex format must read the sectors and call
           CcDnld_startDownload once the sector address and size
           are known */

        /* For intel hex the num bytes is roughly 1/2 the bytes
           in the file as the bytes are ascii. This is ignoring
           the Sector headers */
        byteCount /= 2;
    }

    /* set bytesLeft so we know the progress */
    bytesLeft = byteCount;

    /* make sure the file pointer is at the start of the file */
    rewind(sblFileHandle);

    while(feof(sblFileHandle) == 0)
    {
        float percentDone = 100 - (100 * ((float)bytesLeft / (float)byteCount));
        printProgressBar(percentDone);

        /* check if we need to read more data */
        if(byesInBuffer == 0)
        {
            dataIdx = 0;
            if(binMode)
            {
                byesInBuffer = fread(pData, 1, DATA_BUFFER_SIZE, sblFileHandle);
            }
            else
            {
                unsigned int sectorStartAddress;
                /* get next intel hex records */
                getNextIntelHexRecords(pData, &sectorStartAddress, &byesInBuffer, sblFileHandle);
                if( CcDnld_startDownload(sectorStartAddress, byesInBuffer, deviceType) != CcDnld_Status_Success )
                {
                    printColor(CONSOLE_COLOR_RED, "\n\rError during download\n");
                    fclose(sblFileHandle);
                    exit(EXIT_FAILURE);
                }
            }
        }

        /* Limit transfer count */
        if(CCDNLD_MAX_BYTES_PER_TRANSFER < byesInBuffer)
        {
            bytesInTransfer = CCDNLD_MAX_BYTES_PER_TRANSFER;
        }
        else
        {
            bytesInTransfer = byesInBuffer;
        }

        /* Send Data command */
        ccDnldStatus = CcDnld_sendData(&pData[dataIdx], bytesInTransfer);
        if(ccDnldStatus != CcDnld_Status_Success)
        {
            unsigned int retry = 0;
            /* Allow up to 3 successive retries to send the data to the target */
            while(retry++ < 3 && (ccDnldStatus = CcDnld_sendData(&pData[dataIdx], bytesInTransfer)) != CcDnld_Status_Success);
            if(ccDnldStatus != CcDnld_Status_Success)
            {
                printColor(CONSOLE_COLOR_RED, "\n\rError during download\n");
                fclose(sblFileHandle);
                exit(EXIT_FAILURE);
            }
        }

