nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/apps/linux/example/cc13xx-sbl/app/linux/main.c
        /* Update index and bytesLeft */
        byesInBuffer -= bytesInTransfer;
        dataIdx += bytesInTransfer;
        bytesLeft -= bytesInTransfer;
    }

    printProgressBar(100);
}

static void verifyFile(FILE* sblFileHandle, unsigned int byteCount)
{
    CcDnld_Status ccDnldStatus;
    uint8_t pData[DATA_BUFFER_SIZE];
    unsigned int byesInBuffer = 0;
    unsigned int bytesLeft;

    printf("Verifying: \n[                                                  ] 00%%");

    /* make sure the file pointer is at the start of the file */
    rewind(sblFileHandle);

    bytesLeft = byteCount;
    unsigned int dataOffset = startAddress;
    while(feof(sblFileHandle) == 0)
    {
        float percentDone = 100 - (100 * ((float)bytesLeft / (float)byteCount));
        printProgressBar(percentDone);

        /* read more data */
        if(binMode)
        {
            byesInBuffer = fread(pData, 1, DATA_BUFFER_SIZE, sblFileHandle);
        }
        else
        {
            /* get next intel hex records */
            getNextIntelHexRecords(pData, &dataOffset, &byesInBuffer, sblFileHandle);
        }

        ccDnldStatus = CcDnld_verifyData(dataOffset, pData, byesInBuffer);
        if(ccDnldStatus == CcDnld_Status_Crc_Error)
        {
            printColor(CONSOLE_COLOR_RED, "CRC error\n");
            fclose(sblFileHandle);
            exit(EXIT_FAILURE);
        }
        else if(ccDnldStatus != CcDnld_Status_Success)
        {
            printColor(CONSOLE_COLOR_RED, "Error during verify\n");
            fclose(sblFileHandle);
            exit(EXIT_FAILURE);
        }

        /* Update bytesLeft and data offset */
        bytesLeft -= byesInBuffer;
        dataOffset += byesInBuffer;
    }

    printProgressBar(100);
}

static void exitHandler(void)
{
    if(portIsOpen && SblUart_close())
    {
        printf("Abnormal termination, port close successful\n");
    }
}

static void sigHandler(int sig)
{
    printf("Signal: %d\n", sig);
    exit(EXIT_FAILURE);
}

int main(int argc, char* argv[])
{
    FILE* sblFileHandle;
    char * selectedSerialPort;
    char * binFile;
    char * deviceType;
    struct stat st;
    unsigned int byteCount;
    uint32_t pageSize;

#ifdef SBL_TWO_WIRE
    printf("Using Two wrire SBL Interface\n");
#else
    printf("Using USB SBL Interface\n");
#endif

    /* Setup the exit handler */
    atexit(exitHandler);

    signal(SIGHUP,  sigHandler); /* Hangup */
    signal(SIGINT,  sigHandler); /* Ctrl-C */
    signal(SIGILL,  sigHandler); /* Illegal instruction */
    signal(SIGABRT, sigHandler); /* Abort */
    signal(SIGSEGV, sigHandler); /* Segment fault */
    signal(SIGTERM, sigHandler); /* Terminate */
    signal(SIGSTOP, sigHandler); /* Stop */

    printf("%s %s -- %s %s\n\n", argv[0], CCDNLD_API_VERSION, __DATE__, __TIME__);

    if (argc < 4)
    {
        usage(argv[0]);
        exit(EXIT_FAILURE);
    }
    else
    {
        selectedSerialPort = argv[1];
        binFile = argv[2];
        deviceType = argv[3];
    }

    getOptions(argc, argv);

    if (CcDnld_getPageSize(deviceType) == 0) {
        printColor(CONSOLE_COLOR_RED, "Invalid device type %s\n", deviceType);
        exit(EXIT_FAILURE);
    }
    else {
        printColor(CONSOLE_COLOR_GREEN, "\rDevice set to: %s\n", deviceType);
    }

    printf("Opening serial port %s\n", selectedSerialPort);
    if (SblUart_open(selectedSerialPort) == -1)
    {
        printColor(CONSOLE_COLOR_RED, "could not open serial port\n");
        exit(EXIT_FAILURE);
    }

    portIsOpen = true;

    /* Check if file is a Binary or Intel Hex */
    if(strcasestr(binFile, ".bin") != 0)
    {
        binMode = true;
    }
    else if(strcasestr(binFile, ".hex") != 0)
    {
        binMode = false;
    }
    else
    {
        printColor(CONSOLE_COLOR_YELLOW, "Unrecognized file extension. Supported formats are *.bin and *.hex\n");
        printColor(CONSOLE_COLOR_YELLOW, "Assuming Intel Hex format\n");
        binMode = false;
    }

    printf("Open binary file %s\n", binFile);
    sblFileHandle = fopen(binFile, "r");

    if(sblFileHandle == NULL)
    {
        printColor(CONSOLE_COLOR_RED, "Binary file cannot be read\n");
        exit(EXIT_FAILURE);
    }

    if( stat( binFile, &st ) != 0 ){
        perror( binFile );
        printColor(CONSOLE_COLOR_RED, "Error reading size of Binary file\n");
        exit(EXIT_FAILURE);
    }

    byteCount = st.st_size;
    if(byteCount==0)
    {
        printColor(CONSOLE_COLOR_RED, "Binary file 0 length\n");
        exit(EXIT_FAILURE);
    }
    printf("Binary file size = %d\n", byteCount);

    CcDnld_init(&sblUartFxns);

    /* connect to CC13xx bootloader */
    connectToBootloader();

    /* Now that we know the device type, we can verify the startAddress is valid */
    if(startAddress)
    {
        pageSize = CcDnld_getPageSize(deviceType);

        verifyStartAddress(pageSize);
    }

    if(eraseFlg)
    {
        eraseFlash(deviceType);
    }

    if(programFlg)
    {
        downloadFile(sblFileHandle, byteCount, deviceType);
    }

    if(verifyFlg)
    {
        verifyFile(sblFileHandle, byteCount);
    }

    printColor(CONSOLE_COLOR_GREEN, "\n\rOperation completed successfully\n");

    if(SblUart_close())
    {
        portIsOpen = false;
    }

    fclose(sblFileHandle);

    return (0);
}


/*
 *  ========================================
 *  Texas Instruments Micro Controller Style
 *  ========================================
 *  Local Variables:
 *  mode: c
 *  c-file-style: "bsd"
 *  tab-width: 4
 *  c-basic-offset: 4
 *  indent-tabs-mode: nil
 *  End:
 *  vim:set  filetype=c tabstop=4 shiftwidth=4 expandtab=true
 */
